
const t = 'абажур аббревиатура абзац абонемент абориген абстрактный абстракция авангард автограф автоматизация автострада агентство адекватный адъюнкт адъютант ажиотаж айсберг академия акварель акклиматизация аккомпанемент аккомпаниатор аккорд аккордеон аккумулятор аккуратный аксессуар актуальный алеет аллегория аллея аллитерация альбатрос альманах альтернатива альфа-лучи алюминий амплитуда амплуа анафора анахронизм анекдот анналы аннотация антенна антициклон антология аплодисменты апогей апостол апофеоз аппарат аппендицит аппетит аппликация артикуляция артиллерия архаизм асессор асимметрия ассамблея ассистент атолл аттестат аттракцион аудитория бадминтон базар балл баллада балласт баллон барельеф барокко баррикада бархат бассейн батальон батискаф безалаберный безапелляционный безжалостный безошибочно безынициативный безынтересный безыскусный безысходный белиберда белладонна белорус бельэтаж бескозырка беспрецедентный бесприданница беспроцентно-выигрышный бессонница бесспорный бессчётный бесчувственный бетон бефстроганов бечева биатлон бидон бизнесмен биллион бильярд биография благословить бледно-розовый блеснуть близкородственный блокпост бомбардировщик бонбоньерка бороздчатый брандспойт бриллиант букинист буланый бумеранг бухгалтер бюллетень ва-банк вагоностроительный вакуум вакханалия варежка ваттметр вблизи вбок вброд вверх ввиду вволю ввысь вдалеке вдобавок вдогонку вдребезги вегетарианский велеречивый великоросс великорус веранда вермишель вернисаж вертишейка верфь вестибюль винегрет виньетка виолончель витаминизированный вкось вкрутую влёт вмиг внакидку внакладе внешкольный вниз вничью вновь вовек водоросль военачальник вожжи воззрение впервые вперевалку впереди вперемежку вперемешку вперёд вплавь вплотную вповалку вполголоса вполоборота вполсилы впопыхах впоследствии впотьмах вправо впредь вприглядку вприпрыжку вприсядку впритык вразбивку вразвалку врасплох врассыпную всерьёз вслепую вслух вспять втёмную втихомолку второпях втрое втроём втройне габарит галлюцинация гардероб генеалогия гигиена гипербола горемыка градация грамм грейпфрут грипп группа гуашь гуттаперча да здравствует дебаты девяносто декларация дельтаплан деривация десоциализация дефицит джентльмен диктант диктофон дипломат дисквалификация диссертация диссонанс дифирамб дифференцировать довлеть доминанта доныне достопримечательность дотла древнерусский дрожжи евразийский ежовый еретик ёмкость жакет жасмин желатин жёлоб жёлудь жёрдочка жокей жонглёр жор жужелица жюри замуж запанибрата запятая защёлка званый здравствуй землетрясение златокованый златотканый зодиак иван-да-марья иван-чай идентичный идиллия идиома иероглиф иждивенчество извечно издавна издревле изжога изморозь изморось изнутри иллюзия иллюминация иллюстрация иммунитет ингредиент инкассатор интеллект интеллигент инфинитив инъекция ипподром искусный исподтишка исследовательский йог йогурт йод кабинет-секретарь кавалькада какаду какофония калейдоскоп календарь каллиграфия калькулятор каньон касса кассета катавасия килограмм километр класс клише коврижка коллегия коллизия коллоквиум колонна колоннада комментарий компетентный композиция компромисс конституционный контекст контригра конференция коралл корчёвка коттедж лабиринт ландшафт луноход мавзолей магнолия мажорный майонез макулатура мандарин манипуляция маскарад массаж мачеха медальон металл металлолом метаморфоза метафора метеоролог метрдотель миллион миротворец морфология моцион мультимедиа мэр набело наверх навечно навзничь навзрыд наглухо надвое наедине назло наизнанку наизусть наискосок наискось наитие наперебой наперевес наперегонки наперерез наперехват напролом нараспев нарцисс наряду насквозь насмарку наугад наудалую начистоту небылица невтерпёж недоучка ненароком неологизм ничком новелла ностальгия оазис обелиск обогащать объект озон оккупация оранжерея орфограмма орфография орфоэпия павильон пакгауз палеограф палисадник пантомима папоротник параграф парадоксальный парашют пассаж пассажир патронташ пейзаж перекати-поле периферия перпендикуляр пескарь пессимист по-иному побоку подобру-поздорову полицмейстер понаслышке понтон презентация пресса престиж притча прожектор пропаганда пудинг равелин рафинад резервуар ремарка саванна сагитировать санаторий сандалия сарафан сбоку священник семантика семинар симметрия снегирь сожжённый социализация спроста такелаж тамада танцор телетайп темперамент тушёнка тушь уездный университет ураган фабула фаэтон фейерверк фельдъегерь фестиваль философ фонема фонтан формализм халат хлеб-соль хлестать хлёсткий худо-бедно целлофан целлюлоза ценность центнер циклон цилиндр цилиндропоршневая циферблат цыган цыкать цып-цып цыпки цыплёнок цыпочки цыц часовня чемпион четыреста шаблон шампиньон шарада шасси шеренга шов шорох шпаргалка щедроты щеколда щупальца э-ге-ге эвкалипт эволюция эвфемизм эгида эквивалент экзамен экземпляр экспрессия элегия эликсир эпиграмма эпилог этикет юннат юный явственный ядрёный якобы январский яство ятаган';

const WORD_ARRAY = t.split(' ');


const display = document.querySelector('.word-time').querySelector('b');
const keyWord = document.querySelector('.key-word');

const game = document.querySelector('.word-game');
const text = document.querySelector('.userInput');


const startButton = document.querySelector('.start-button')

const counts = document.getElementById('word-count');

const timer = document.querySelector('.word-time')
const tryes = document.querySelector('.last-try');
const ul = tryes.querySelector('ul');
const lastTryTemplate = document.querySelector('#last-try-template');
const bTemp = lastTryTemplate.content.querySelector('li');
const record = document.querySelector('.record-value');
const recordTitle = document.querySelector('.record');
const presentCount = document.querySelector('.get-present-count');
const TIMEOUT = 30000;

let points = 0;
let recordDef = 0;
let startCountPresent = 0


const changeInputValue = () => {
    if(keyWord.textContent === text.value.toUpperCase()){
        points+=1;
        startGame();
        counts.textContent = points;
    }
}


const random = (min, max) => {
    return Math.floor(Math.random() * (max - min)) + min;
}

const onCountRulesClick = () =>{
    game.classList.remove('hide');
    startButton.classList.add('hide');
    timer.classList.remove('hide');
    console.log('aboba');
    tryes.classList.remove('hide');
    recordTitle.classList.remove('hide');
    time()
    counts.textContent = 0;
    startGame();
    
}

const setRules = () =>{
    points = 0;
    startButton.addEventListener('click', onCountRulesClick);
}

setRules();


const startGame = () => {
    text.value = '';

    keyWord.textContent = WORD_ARRAY[random(0, WORD_ARRAY.length)].toUpperCase().replace('Ё', 'Е') ;
    text.addEventListener('input', changeInputValue);
}





const time = () =>{
    
    
    const startTIme = Date.now();
    
    display.textContent = formatTime(TIMEOUT);
    
    const interval = setInterval(() => {
        const delta = Date.now() - startTIme;
        display.textContent = formatTime(TIMEOUT - delta);
        
    }, 100);

    const timeout = setTimeout(() => {
        
        display.textContent = 'вышло';
        
        clearInterval(interval);
        clearTimeout(timeout);
        
        bTemp.textContent = 'Количество очков: '+parseInt(counts.textContent);
        startCountPresent+=parseInt(counts.textContent);
        presentCount.querySelector('b').textContent = startCountPresent + ' ';
        if(startCountPresent > 50){
            presentCount.textContent = 'Промокод на 40% скидку в my-shop.ru: SORRY'
        }
        if (parseInt(counts.textContent) > recordDef){
            recordDef = parseInt(counts.textContent);
            record.textContent = recordDef
        }
        let temp = lastTryTemplate.content.cloneNode(true);
        game.classList.add('hide');
        ul.append(temp);
        startButton.classList.remove('hide');
        text.addEventListener('input', changeInputValue);
        setRules();
    }, TIMEOUT);

}


function formatTime(ms){
    return Number.parseFloat(ms/1000).toFixed(2)
}

